/**
 *          ===== 테스트 주도 개발을 실천 =====
 *
 *      - 단위 테스트 : 시간이 지나더라도 완벽한 프로그람을 맨들게 해줌
 *          단위(unit) : 특정 조건에서 어떻게 작동할지 정의
 *          ( 단위 테스트 본체에 작성한 코드는 준비, 실행, 단언의 단계를 따름 )
 *
 *      --> 준비( arrange ) : 실행할 조건을 정함, 의존성 및 함수 입력 데이터 설정
 *
 *      --> 실행( act ) : 준비 단계에서 설정한 입력값을 함수에 넘겨 실행
 *
 *      --> 단언( assert ) : 미리 정한 조건에 따라 예상한대로 단위가 작동하는지 확인
 *
 *      - 테스트 주도 개발(TDD)은 프로그람을 제대로 작성했는지 보장함.
 *
 *      1. 완벽히 변경하면 성공하나 그렇게 되기 전까지는 반드시 실패하는 단위 테스트 작성.
 *
 *      2. 테스트가 성공할 수 있을만큼 '최소한'으로 코딩.
 *
 *      3. 애플리케이션 코드를 리팩토링하며 중복 제거.
 *
 *      - 코드를 짜기 전에 테스트를 먼저 작성.
 */