/**
 *            ===== 정리하기 =====
 *
 *      - 지금장은 JS 개발도구 및 즐겨쓰는 테크닉 소개
 *
 *      1. 단위 테스팅 프레임워크 : 올바른 소프트웨어 개발의 필수품
 *                            ( 재스민 , QUint , D.O.H 등 )
 *      --> JS 애플리케이션이 점점 복잡해지면서 컴포넌트를 잘 정돈하고
 *          분리하는 일이 중요해짐
 *
 *      2. 의존성 주입 ( DIContainer )
 *      --> 따라서 의존성 주입은 매우 중요한 테크닉
 *
 *      3. 애스팩트 지향 프로그래밍 툴킷( AOP )
 *      --> 전체 컴포넌트를 바꾸지 않고도 캐싱같은 공통기능을 소프트웨어 컴포넌트에 끼워넣을 수 있음
 *          ( 코드를 DRY 하게 유지 )
 *      --> 즉 , 단일 책임 원칙을 갖고 개방/폐쇄 원칙에 충실한 코드 작성 가능
 *
 *      4. 린터( Linter )는 코드 검사 도구
 *         ( 코드의 믿음성을 높임 )
 */
title( '정리하기' );
{
}